Extensions/src/Documents/АвансовыйОтчет/АвансовыйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>АвансовыйОтчет</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

Extensions/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КурсыВалют</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Кратность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Extensions/src/Documents/АвансовыйОтчет/ManagerModule.bsl
&Вместо("СформироватьТаблицаРасчетыСПодотчетниками")
Процедура РасшAzRy_СформироватьТаблицаРасчетыСПодотчетниками(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства)
	
	Если Не ДокументСсылкаАвансовыйОтчет.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
		ПродолжитьВызов(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАвансовыйОтчет);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ПогашениеДолгаПодотчетника", НСтр("ka='საქვეანგარიშო პირის ვალის დაფარვა';ru='Погашение долга подотчетника';en='Repayment of debt podotchetnika'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированныйПланСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов); //+++ ДМГГ
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицыДокумента.ЭтоЗП КАК ЭтоЗП,
	|	МАКСИМУМ(ТаблицыДокумента.НомерСтроки) КАК НомерСтроки,
	|	&ПогашениеДолгаПодотчетника КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ТаблицыДокумента.Период КАК Период,
	|	ТаблицыДокумента.Сотрудник КАК Сотрудник,
	|	ТаблицыДокумента.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|	ТаблицыДокумента.СчетРасчетовПоПерерасходу КАК СчетУчета,
	|	ТаблицыДокумента.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|	ТаблицыДокумента.СчетРасчетовПоПерерасходуРегл КАК СчетУчетаРегл,
	|	ТаблицыДокумента.Валюта КАК Валюта,
	|	&Ссылка КАК Документ,
	|	СУММА(ТаблицыДокумента.Сумма) КАК Сумма,
	|	СУММА(ТаблицыДокумента.СуммаВал) КАК СуммаВал,
	|	ТаблицыДокумента.Статья
	|ПОМЕСТИТЬ ВременнаяТаблицаРасходыПодотчетногоЛица
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЛОЖЬ КАК ЭтоЗП,
	|		МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|		ТаблицаДокумента.Период КАК Период,
	|		ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходуРегл КАК СчетРасчетовПоПерерасходуРегл,
	|		ТаблицаДокумента.Валюта КАК Валюта,
	|		ТаблицаДокумента.Статья КАК Статья,
	|		СУММА(ТаблицаДокумента.СуммаБезНалогов) КАК Сумма,
	|		СУММА(ТаблицаДокумента.СуммаБезНалоговВал) КАК СуммаВал
	|	ИЗ
	|		ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Сотрудник,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетниками,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходу,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетникамиРегл,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходуРегл,
	|		ТаблицаДокумента.Статья,
	|		ТаблицаДокумента.Валюта
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЛОЖЬ,
	|		МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Сотрудник,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетниками,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходу,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетникамиРегл,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходуРегл,
	|		ТаблицаДокумента.Валюта,
	|		ТаблицаДокумента.Статья,
	|		СУММА(ТаблицаДокумента.СуммаБезНалогов),
	|		СУММА(ТаблицаДокумента.СуммаБезНалоговВал)
	|	ИЗ
	|		ВременнаяТаблицаРасходы КАК ТаблицаДокумента
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Сотрудник,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетниками,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходу,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетникамиРегл,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходуРегл,
	|		ТаблицаДокумента.Статья,
	|		ТаблицаДокумента.Валюта
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЛОЖЬ,
	|		МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Сотрудник,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетниками,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходу,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетникамиРегл,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходуРегл,
	|		ТаблицаДокумента.ВалютаДокумента,
	|		ТаблицаДокумента.Статья,
	|		СУММА(ТаблицаДокумента.Сумма),
	|		СУММА(ТаблицаДокумента.СуммаПлатежа)
	|	ИЗ
	|		ВременнаяТаблицаОплаты КАК ТаблицаДокумента
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Сотрудник,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетниками,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходу,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетникамиРегл,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходуРегл,
	|		ТаблицаДокумента.Статья,
	|		ТаблицаДокумента.ВалютаДокумента
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИСТИНА,
	|		МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Сотрудник,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетниками,
	|		ТаблицаДокумента.СчетРасчетовСПерсоналом,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетникамиРегл,
	|		ТаблицаДокумента.СчетРасчетовСПерсоналомРегл,
	|		ТаблицаДокумента.ВалютаДокумента,
	|		NULL,
	|		СУММА(ТаблицаДокумента.СуммаПоСотруднику),
	|		СУММА(ТаблицаДокумента.СуммаПоСотрудникуВал)
	|	ИЗ
	|		ВременнаяТаблицаПлатежныеВедомости КАК ТаблицаДокумента
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Сотрудник,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетниками,
	|		ТаблицаДокумента.СчетРасчетовСПерсоналом,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетникамиРегл,
	|		ТаблицаДокумента.СчетРасчетовСПерсоналомРегл,
	|		ТаблицаДокумента.ВалютаДокумента) КАК ТаблицыДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицыДокумента.ЭтоЗП,
	|	ТаблицыДокумента.Период,
	|	ТаблицыДокумента.Сотрудник,
	|	ТаблицыДокумента.СчетРасчетовСПодотчетниками,
	|	ТаблицыДокумента.СчетРасчетовПоПерерасходу,
	|	ТаблицыДокумента.СчетРасчетовСПодотчетникамиРегл,
	|	ТаблицыДокумента.СчетРасчетовПоПерерасходуРегл,
	|	ТаблицыДокумента.Валюта,
	|	ТаблицыДокумента.Статья
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	&ПогашениеДолгаПодотчетника КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	ТаблицаДокумента.Ссылка.Сотрудник КАК Сотрудник,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетУчета,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовПоПерерасходуРегл КАК СчетРасчетовПоПерерасходуРегл,
	//+++ Дмгг
	//|	ТаблицаДокумента.Документ.ВалютаДенежныхСредств КАК Валюта, 
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Конвертация
	|			ТОГДА ТаблицаДокумента.Документ.ВалютаПолучатель
	// +++ { AzRy - [08.12.2021] - Developer:გიორგი მამულაშვილი - Comment: 
	//|		ИНАЧЕ ТаблицаДокумента.Документ.ВалютаДенежныхСредств
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.ВалютаДокумента
	// +++ } AzRy - [08.12.2021] - Developer:გიორგი მამულაშვილი - Comment: 	
	
	|	КОНЕЦ КАК Валюта,
	//--- Дмгг		
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.Документ.Статья КАК Статья,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.Сумма * КурсыВалютВыданныхАвансов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютВыданныхАвансов.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаВал,
	|	-СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.Сумма * КурсыВалютВыданныхАвансов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютВыданныхАвансов.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаДляОстатка,
	|	-СУММА(ТаблицаДокумента.Сумма) КАК СуммаВалДляОстатка
	|ПОМЕСТИТЬ ВременнаяТаблицаВыданныеАвансы
	|ИЗ
	|	Документ.АвансовыйОтчет.ВыданныеАвансы КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютВыданныхАвансов
	//|		ПО ТаблицаДокумента.Документ.ВалютаДенежныхСредств = КурсыВалютВыданныхАвансов.Валюта
	|		ПО ВЫБОР
	|			КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Конвертация
	|				ТОГДА ТаблицаДокумента.Документ.ВалютаПолучатель
	// +++ { AzRy - [08.12.2021] - Developer:გიორგი მამულაშვილი - Comment: 
	//|				ИНАЧЕ ТаблицаДокумента.Документ.ВалютаДенежныхСредств
	|				ИНАЧЕ ТаблицаДокумента.Ссылка.ВалютаДокумента
	// +++ } AzRy - [08.12.2021] - Developer:გიორგი მამულაშვილი - Comment:
	|		КОНЕЦ = КурсыВалютВыданныхАвансов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ТаблицаДокумента.Ссылка.Сотрудник,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл,
	//|	ТаблицаДокумента.Документ.ВалютаДенежныхСредств
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Конвертация
	|			ТОГДА ТаблицаДокумента.Документ.ВалютаПолучатель
	// +++ { AzRy - [08.12.2021] - Developer:გიორგი მამულაშვილი - Comment: 
	//|		ИНАЧЕ ТаблицаДокумента.Документ.ВалютаДенежныхСредств
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.ВалютаДокумента
	// +++ } AzRy - [08.12.2021] - Developer:გიორგი მამულაშვილი - Comment:
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	Валюта,
	|	Документ,
	|	СчетУчета,
	|	СчетУчетаРегл";
	
	Запрос.ВыполнитьПакет();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с подотчетными лицами.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВременнаяТаблицаВыданныеАвансы.Организация КАК Организация,
	|	ВременнаяТаблицаВыданныеАвансы.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблицаВыданныеАвансы.Валюта КАК Валюта,
	|	ВременнаяТаблицаВыданныеАвансы.Документ КАК Документ
	|ИЗ
	|	ВременнаяТаблицаВыданныеАвансы КАК ВременнаяТаблицаВыданныеАвансы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПодотчетниками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	//Паганини_
	//|	ТаблицаДокумента.Сумма КАК Сумма
	|	ТаблицаДокумента.СуммаБезНалогов КАК Сумма
	//_Паганини
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	//Паганини_
	//|	ТаблицаДокумента.Сумма
	|	ТаблицаДокумента.СуммаБезНалогов
	//_Паганини
	|ИЗ
	|	ВременнаяТаблицаРасходы КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаОплаты.Сумма
	|ИЗ
	|	ВременнаяТаблицаОплаты КАК ВременнаяТаблицаОплаты
	//+++ Дмгг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаПлатежныеВедомости.СуммаПоСотруднику
	|ИЗ
	|	ВременнаяТаблицаПлатежныеВедомости КАК ВременнаяТаблицаПлатежныеВедомости
	//--- Дмгг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыОстатки.Организация КАК Организация,
	|	РасчетыОстатки.Сотрудник КАК Сотрудник,
	|	РасчетыОстатки.Валюта КАК Валюта,
	|	РасчетыОстатки.Документ КАК Документ,
	|	РасчетыОстатки.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетУчета,
	|	РасчетыОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл КАК СчетУчетаРегл, //+++
	|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
	|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВременнаяТаблица.Организация КАК Организация,
	|		ВременнаяТаблица.Сотрудник КАК Сотрудник,
	|		ВременнаяТаблица.Валюта КАК Валюта,
	|		ВременнаяТаблица.Документ КАК Документ,
	|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
	|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
	|	ИЗ
	|		ВременнаяТаблицаВыданныеАвансы КАК ВременнаяТаблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаОстатки.Организация,
	|		ТаблицаОстатки.Сотрудник,
	|		ТаблицаОстатки.Валюта,
	|		ТаблицаОстатки.Документ,
	|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
	|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
	|	ИЗ
	|		РегистрНакопления.РасчетыСПодотчетниками.Остатки(
	|				&МоментВремени,
	|				(Организация, Сотрудник, Валюта, Документ) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВременнаяТаблицаВыданныеАвансы.Организация,
	|						ВременнаяТаблицаВыданныеАвансы.Сотрудник,
	|						ВременнаяТаблицаВыданныеАвансы.Валюта,
	|						ВременнаяТаблицаВыданныеАвансы.Документ
	|					ИЗ
	|						ВременнаяТаблицаВыданныеАвансы)) КАК ТаблицаОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокумента.Организация,
	|		ДвиженияДокумента.Сотрудник,
	|		ДвиженияДокумента.Валюта,
	|		ДвиженияДокумента.Документ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РасчетыСПодотчетниками КАК ДвиженияДокумента
	|	ГДЕ
	|		ДвиженияДокумента.Регистратор = &Ссылка
	|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыОстатки.Организация,
	|	РасчетыОстатки.Сотрудник,
	|	РасчетыОстатки.Валюта,
	|	РасчетыОстатки.Документ,
	|	РасчетыОстатки.Сотрудник.СчетРасчетовСПодотчетниками
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	Валюта,
	|	Документ,
	|	СчетУчета,
	|	СчетУчетаРегл //+++ Дмгг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	1 КАК НомерСтроки,
	|	&ПериодКонтроля КАК Дата,
	|	ТаблицаРасчеты.Организация КАК Организация,
	|	ТаблицаРасчеты.Сотрудник КАК Сотрудник,
	|	ТаблицаРасчеты.Валюта КАК Валюта,
	|	ТаблицаРасчеты.Документ КАК Документ,
	|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
	|	ТаблицаРасчеты.СчетУчета КАК СчетУчета,
	|	ТаблицаРасчеты.СчетУчетаРегл КАК СчетУчетаРегл //+++
	|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетниками
	|ИЗ
	|	ВременнаяТаблицаВыданныеАвансы КАК ТаблицаРасчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
	|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
	|			И ТаблицаРасчеты.Сотрудник = ТаблицаОстатки.Сотрудник
	|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.Валюта
	|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
	|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
	//+++ Дмгг
	//|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
	|			И ВЫБОР
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА ТаблицаРасчеты.СчетУчетаРегл = ТаблицаОстатки.СчетУчетаРегл
	|				ИНАЧЕ ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
	|			КОНЕЦ
	//--- Дмгг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаВалютаУчета.Значение
	|					ИЗ
	|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВременнаяТаблицаВыданныеАвансы.Валюта
	|					ИЗ
	|						ВременнаяТаблицаВыданныеАвансы)) КАК КурсыВалютРасчетовСрезПоследних
	|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
	|ГДЕ
	|	(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
	|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки,
	|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
	|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
	|	ТаблицаДокумента.СчетУчетаРегл КАК СчетУчетаРегл, //+++
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Валюта КАК Валюта,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	ТаблицаДокумента.СуммаВал КАК СуммаВал
	|ИЗ
	|	ВременнаяТаблицаВыданныеАвансы КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.СодержаниеПроводки,
	|	ТаблицаДокумента.ВидДвижения,
	|	ТаблицаДокумента.СчетУчета,
	|	ТаблицаДокумента.СчетУчетаРегл, //+++
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Сотрудник,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Валюта,
	|	ТаблицаДокумента.Сумма - ЕСТЬNULL(ТаблицаВыданныеАвансы.Сумма, 0),
	|	ТаблицаДокумента.СуммаВал - ЕСТЬNULL(ТаблицаВыданныеАвансы.СуммаВал, 0)
	|ИЗ
	|	ВременнаяТаблицаРасходыПодотчетногоЛица КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВременнаяТаблицаВыданныеАвансы.Валюта КАК Валюта,
	|			СУММА(ВременнаяТаблицаВыданныеАвансы.Сумма) КАК Сумма,
	|			СУММА(ВременнаяТаблицаВыданныеАвансы.СуммаВал) КАК СуммаВал
	|		ИЗ
	|			ВременнаяТаблицаВыданныеАвансы КАК ВременнаяТаблицаВыданныеАвансы
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВременнаяТаблицаВыданныеАвансы.Валюта) КАК ТаблицаВыданныеАвансы
	|		ПО ТаблицаДокумента.Валюта = ТаблицаВыданныеАвансы.Валюта
	|ГДЕ
	|	ТаблицаДокумента.СуммаВал - ЕСТЬNULL(ТаблицаВыданныеАвансы.СуммаВал, 0) > 0
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	3,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	&КурсоваяРазница,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.СчетУчетаРегл,
	//|	ТаблицаДокумента.Документ,
	//|	ТаблицаДокумента.Сотрудник,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ТаблицаДокумента.Валюта,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	0
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетниками КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаСумм = МассивРезультатов[0].Выгрузить(); // таблица для расчета ошибки округления
	ТаблицаРезультата = МассивРезультатов[3].Выгрузить();
	
	СуммаВсего = ТаблицаСумм.Итог("Сумма"); // сумма для расчета ошибки округления
	СуммаРезультата = ТаблицаРезультата.Итог("Сумма");
	РазницаРезультата = СуммаВсего - СуммаРезультата;
	
	//Если РазницаРезультата <> 0
	//	И ТаблицаРезультата.Количество() > 0 Тогда
	//	ТаблицаРезультата[0].Сумма = ТаблицаРезультата[0].Сумма + РазницаРезультата;
	//КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПодотчетниками", ТаблицаРезультата);
		
КонецПроцедуры
